Revit 2024 API
SolidGlass.SolidglassBumpAmount Property
 The property labeled "Amount" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string SolidglassBumpAmount { get; }
Visual Basic
Public Shared ReadOnly Property SolidglassBumpAmount As String
	Get
Visual C++
public:
static property String^ SolidglassBumpAmount {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace